Dynamo.Graph.Workspaces.PackageDependencyInfo.AddDependents(System.Collections.Generic.IEnumerable{System.Guid})
Add the Guids of a dependent nodes
guids:

Dynamo.Graph.Workspaces.PackageDependencyInfo.RemoveDependent(System.Guid)
Remove a dependent node
guid: