Dynamo.Logging.Analytics.CreateTimedEvent(Dynamo.Logging.Categories,System.String,System.String,System.Nullable{System.Int32})
Creates a new timed event with start state and tracks its start.
Disposing the returnd event will record the event completion.
category: Event category
variable: Timed varaible name
description: Event description
value: A metric value associated with the event
Returns: Event as IDisposable