Dynamo.Graph.Workspaces.LayoutExtensions.DoGraphAutoLayout(Dynamo.Graph.Workspaces.WorkspaceModel)
This function wraps a few methods on the workspace model layer
to set up and run the graph layout algorithm.

Dynamo.Graph.Workspaces.LayoutExtensions.RecordUndoGraphLayout(Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean)
This method adds relevant models to the undo recorder.
workspace: A Dynamo.Graph.Workspaces.WorkspaceModel.
isGroupLayout: True if all the selected models are groups.